8.4 Modificar ACLs.


# 8.4.2 Método do Editor de Texto
ACLs com várias ACEs devem ser criadas em um editor de texto. Isso permite planejar as ACEs necessárias, criar a ACL e colá-la na interface do roteador. Ele também simplifica as tarefas para editar e corrigir uma ACL.

Por exemplo, suponha que a ACL 1 foi inserida incorretamente usando 19 em vez de 192 para o primeiro octeto, como mostrado na configuração em execução.


~~~~
R1# show run | section access-list
access-list 1 deny 19.168.10.10
access-list 1 permit 192.168.10.0 0.0.0.255
R1#
~~~~
No exemplo, a primeira ACE deveria ter sido negar o host em 192.168.10.10. No entanto, a ACE foi inserida incorretamente.

Para corrigir o erro:

Copie a ACL da configuração em execução e cole-a no editor de texto.
Faça as alterações necessárias.
Remova a ACL configurada anteriormente no roteador. Caso contrário, a colação dos comandos ACL editados só acrescentará (isto é, adicionar) aos Aces ACL existentes no roteador.
Copie e cole a ACL editada de volta para o roteador.
Suponha que a ACL 1 foi corrigida. Portanto, a ACL incorreta deve ser excluída e as instruções ACL 1 corrigidas devem ser coladas no modo de configuração global, conforme mostrado na saída.
~~~~
R1(config)# no access-list 1
R1(config)#
R1(config)# access-list 1 deny 192.168.10.10
R1(config)# access-list 1 permit 192.168.10.0 0.0.0.255
R1(config)#
~~~~


# 8.4.3 Método de número de seqüência
Uma ACL ACE também pode ser excluída ou adicionada usando os números de sequência ACL. Os números de sequência são atribuídos automaticamente quando uma ACE é inserida. Estes números estão listados no comando show access-lists. O comando show running-config não exibe números de sequência.

No exemplo anterior, a ACE incorreta para ACL 1 está usando o número de seqüência 10, como mostrado no exemplo.
~~~~
R1# show access-lists
Standard IP access list 1
    10 deny 19.168.10.10
    20 permit 192.168.10.0, wildcard bits 0.0.0.255
R1#
~~~~
Use o comando ip access-list standard para editar uma ACL. As instruções não podem ser substituídas usando o mesmo número de sequência que uma instrução existente. Portanto, a instrução atual deve ser excluída primeiro com o comandono 10 . Em seguida, a ACE correta pode ser adicionada usando o número de sequência 10 é configurado. Verifique as alterações usando o comando show access-lists, como mostrado no exemplo.
~~~~
R1# conf t
R1(config)# ip access-list standard 1
R1(config-std-nacl)# no 10
R1(config-std-nacl)# 10 deny host 192.168.10.10
R1(config-std-nacl)# end
R1# show access-lists
Standard IP access list 1
    10 deny   192.168.10.10
    20 permit 192.168.10.0, wildcard bits 0.0.0.255
R1#
~~~~


8.5.1 Guia de Configurações ACL
Uma ACL é composta de uma ou mais entradas de controle de acesso (ACEs) ou instruções. Ao configurar e aplicar uma ACL, esteja ciente das diretrizes resumidas nesta lista:

Crie um ACL globalmente e aplique-o.
Ensure the last statement is an implicit deny any or deny ip any any.
Lembre-se de que a ordem da declaração é importante porque os ACLs são processados de cima para baixo.
Assim que uma declaração é correspondida ao ACL, é saído.
Sempre filtre o mais específico para o mais genérico. Por exemplo, negue um host específico e permita todos os outros hosts.
Lembre-se que apenas uma ACL é permitida por interface, por protocolo, por direção.
Lembre-se que novas declarações para uma ACL existente são adicionadas à parte inferior da ACL por padrão.
Lembre-se que os pacotes gerados por roteador não são filtrados por ACLs de saída.
Coloque os ACL padrão o mais próximo possível do destino.
Coloque os ACLs estendidos o mais próximo possível da fonte.


# 8.5.2 Aplique uma ACL.
Depois de criar uma ACL, o administrador pode aplicá-lo de várias maneiras diferentes. O seguinte mostra a sintaxe de comando para aplicar uma ACL a uma interface ou para as linhas VTY.
~~~~
Router(config-if)# ip access-group {acl-# | name} {in | out}
Router(config-line)# access-class {acl-# | name} {in | out}
~~~~
A figura abaixo mostra uma ACL padrão nomeada aplicada ao tráfego de saída.
## Exemplo de ACL padrão nomeado
![image](https://github.com/user-attachments/assets/a8fec86a-288a-44fd-93a4-93a063a11a00)

~~~~
R1(config)# ip access-list standard NO_ACCESS
R1(config-std-nacl)# deny host 192.168.11.10
R1(config-std-nacl)# permit any
R1(config-std-nacl)# exit
R1(config)# interface g0/0
R1(config-if)# ip access-group NO_ACCESS out
~~~~
Esta figura mostra dois ACLs estendidos nomeados. A ACL SURFING é aplicado ao tráfego de entrada e o ACL BROWSING é aplicado ao tráfego de saída.


Exemplo de ACL estendido nomeado

![image](https://github.com/user-attachments/assets/41af35ad-6659-4a46-83b5-312c153d34d8)
~~~~
R1(config)# ip access-list extended SURFING
R1(config-ext-nacl)# permit tcp 192.168.10.0 0.0.0.255 any eq 80
R1(config-ext-nacl)# permit tcp 192.168.10.0 0.0.0.255 any eq 443
R1(config-ext-nacl)# exit
R1(config)# ip access-list extended BROWSING
R1(config-ext-nacl)# permit tcp any 192.168.10.0 0.0.0.255 established
R1(config-ext-nacl)# exit
R1(config)# interface g0/0
R1(config-if)# ip access-group SURFING in
R1(config-if)# ip access-group BROWSING out
~~~~











